In [3]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [5]:
import webbrowser
link = "https://www.tiobe.com/tiobe-index/"
webbrowser.open(link)

True

In [8]:
df = pd.read_clipboard()

In [9]:
df

   Feb 2020  Feb 2019  Change Programming Language  Ratings Change.1
0         1         1     NaN                 Java  17.358%   +1.48%
1         2         2     NaN                    C  16.766%   +4.34%
2         3         3     NaN               Python   9.345%   +1.77%
3         4         4     NaN                  C++   6.164%   -1.28%
4         5         7  change                   C#   5.927%   +3.08%
5         6         5  change    Visual Basic .NET   5.862%   -1.23%
6         7         6  change           JavaScript   2.060%   -0.79%
7         8         8     NaN                  PHP   2.018%   -0.25%
8         9         9     NaN                  SQL   1.526%   -0.37%
9        10        20  change                Swift   1.460%   +0.54%

In [10]:
type(df)

pandas.core.frame.DataFrame

In [12]:
 df.columns

Index(['Feb 2020', 'Feb 2019', 'Change', 'Programming Language', 'Ratings',
       'Change.1'],
      dtype='object')

In [13]:
df.Ratings

0    17.358%
1    16.766%
2     9.345%
3     6.164%
4     5.927%
5     5.862%
6     2.060%
7     2.018%
8     1.526%
9     1.460%
Name: Ratings, dtype: object

In [15]:
df_new = pd.DataFrame(df,columns=['Feb 2020', 'Feb 2019', 'Programming Language'])

In [16]:
 df_new

   Feb 2020  Feb 2019 Programming Language
0         1         1                 Java
1         2         2                    C
2         3         3               Python
3         4         4                  C++
4         5         7                   C#
5         6         5    Visual Basic .NET
6         7         6           JavaScript
7         8         8                  PHP
8         9         9                  SQL
9        10        20                Swift

In [18]:
 type(df['Feb 2020'])

pandas.core.series.Series

In [19]:
df_new = pd.DataFrame(df,columns=['Feb 2020', 'Feb 2019', 'Programming Language','a'])

In [20]:
df_new

   Feb 2020  Feb 2019 Programming Language   a
0         1         1                 Java NaN
1         2         2                    C NaN
2         3         3               Python NaN
3         4         4                  C++ NaN
4         5         7                   C# NaN
5         6         5    Visual Basic .NET NaN
6         7         6           JavaScript NaN
7         8         8                  PHP NaN
8         9         9                  SQL NaN
9        10        20                Swift NaN

In [21]:
df_new['a'] = np.arange(10)

In [23]:
df_new['a'] = range(0,10)

In [24]:
df_new['a'] = pd.Series(np.arange(0,10))

In [25]:
df_new

   Feb 2020  Feb 2019 Programming Language  a
0         1         1                 Java  0
1         2         2                    C  1
2         3         3               Python  2
3         4         4                  C++  3
4         5         7                   C#  4
5         6         5    Visual Basic .NET  5
6         7         6           JavaScript  6
7         8         8                  PHP  7
8         9         9                  SQL  8
9        10        20                Swift  9

In [26]:
df_new['a'] = pd.Series([100,200],index=[1,2])

In [27]:
df_new

   Feb 2020  Feb 2019 Programming Language      a
0         1         1                 Java    NaN
1         2         2                    C  100.0
2         3         3               Python  200.0
3         4         4                  C++    NaN
4         5         7                   C#    NaN
5         6         5    Visual Basic .NET    NaN
6         7         6           JavaScript    NaN
7         8         8                  PHP    NaN
8         9         9                  SQL    NaN
9        10        20                Swift    NaN